<!--  -->
<template>
<div class="healthy">
  <div class="tabList">
    <span v-for="(item, tabListIndex) in tabList" :key="tabListIndex" @click="tabCur=tabListIndex" :class="tabCur == tabListIndex ? 'tabActive' : ''">{{item}}</span>
  </div>

  <transition name="show">
    <div class="healthyContent" v-for="(item, healthyContentIndex) in dataList" :key="healthyContentIndex" v-if="healthyContentIndex==tabCur">
      <h2>{{item.tit}}</h2>
      <p class="titDis">{{item.titDis}}</p>
      <div class="contentItem" v-for="(item1, healthyContentItemIndex) in item.contentMain" :key="healthyContentItemIndex">
        <h3>{{item1.tit}}</h3>
        <p class="contentDis" v-for="(item2, contentDisIndex) in item1.contentDis" :key="contentDisIndex">{{item2}}</p>
        <p class="content" v-for="(item3, contentIndex) in item1.content" :key="contentIndex">{{contentIndex+1}}、{{item3}}</p>
      </div>
    </div>
  </transition>

</div>
</template>

<script>
export default {
  data() {
    return {
      tabCur: '0',
      tabList: [
        '老年痴呆',
        '糖尿病',
        '高血压'
      ],
      dataList: [{
          tit: '了解老年痴呆',
          titDis: '中国社会正在快速老龄化，是世界上唯一一个老年人口超过一亿的国家。有关老龄化的问题是我们要重点关注的命题。同时，老年人口中痴呆的病人越来越多，并且成倍地增长。',
          contentMain: [{
              tit: '一、老年痴呆的概况',
              contentDis: [
                '老年痴呆是指一种发生在老年期的智能衰退，以及人格、性格、行为等表现异常的疾病。老年痴呆是由于大脑神经进行性病变引起的，也叫阿尔茨海默病。老年痴呆严重危害了老年人的健康， 首先带给患者生活上不便， 使患者失去日常生活能力， 在老年人口死亡原因中排名第五位。 其次， 致残率非常高， 使得社会负担、经济负担都比较重。 这种慢性病虽然治疗费用由医疗保险报销部分， 但可能达不到50 % ，给患者的家庭和社会都带来严重影响。',
                '世界上的很多知名人物也得过老年痴呆。例如，英国铁娘子撒切尔夫人、美国前总统里根。很多老年人退休后不融入社会，性格慢慢懒惰、思维逐渐退化，又不跟家人说，所以老年病人的家属，一定要注意这些方面，一旦有这些迹象，一定要早就医。',
                '老年痴呆会有三方面临床表现：一是患者日常生活能力下降；二是会有精神和行为的异常；三是认知障碍。',
                '认知障碍是神经科的专业术语，包括如记忆力、计算力、视空间、语言等方面的障碍，这也是对患者影响最大，最令患者痛苦的症状。'
              ],
              content: [
                '认知障碍中的记忆障碍，例如，一位老大娘出去买菜，结果提个空篮子回来了，家人问她买什么了，干什么去了，她都不记得。这就是记忆力损伤到一定程度了。',
                '计算能力障碍，很小的数都数不清楚，肯定是达到痴呆的水平。其实无论是记忆力还是计算能力，一般到50岁以后都会有一定程度减退，老年人会有一些健忘表现，偶尔会忘东西，算账会偏慢，这都是大脑退化的表现。出现这些症状，也应该尽早就医。',
                '视空间障碍。包括时间、地点、人物等。缺乏地点定向力，就是地点定向力障碍，如患者家住在塔楼，转一圈不知道哪个门是自己家，觉得都是一样的门、一样的颜色，东南西北分不清。人物定向力障碍，严重的患者对着镜子里的自己都认不出来。时间定向障碍，不知道今天是哪一天，甚至春夏秋冬、上午下午都不知道。',
                '语言障碍。患者跟别人交流时，词不达意、自说自话，别人说什么他不理解，而且往往伴随着理解力的障碍。语言、记忆等方面的障碍也会发生在脑血管病人当中，但脑血管病人都是急性发作，而老年痴呆是慢性的、逐渐进展的。',
                '失用。有的老人用筷子不知道上下，不知道是用一支还是用两支。',
                '思维和判断能力障碍。理解力下降，有的患者以前养成每天早上看报纸的习惯，但是现在拿着报纸不知道干什么，拿倒了都不知道，这时就要警惕痴呆的问题。还有思考归纳能力，如买了很多东西需要放到冰箱，有些东西不能放到冰箱。老人在选择的时候，思维过程就发生障碍，不知道摆在哪儿、都应该怎么处理。',
                '劳动能力下降。日常生活中，老人能做的一定要让他做，但一定要有耐心，因为老人常常帮倒忙。老人出错的时候一定要耐心解释，反复多次就能纠正。',
                '情感、性格和行为障碍，有些老人原先很温柔，现在变得容易发脾气；还有老人突然就不爱讲话，这时候就要跟焦虑和抑郁症鉴别开来。'
              ]
            },
            {
              tit: '二、诱发老年痴呆的因素',
              content: [
                '铝摄入过量。大量铝在大脑内聚集，容易损伤神经细胞而导致痴呆。老年人应少用铝制炊具，也不要食用铝罐头。',
                '脑动脉硬化。脑动脉硬化跟脑梗塞不同，一些小动脉的硬化会引起大脑供血不足，导致脑组织发生萎缩，进而导致大脑的功能全面衰退，出现记忆力减退、计算力变差等情况。',
                '内分泌失调。老年人在50岁以后，要尽量把体重控制在正常水平，否则会引起内分泌系统的障碍，引发代谢功能紊乱，如高脂血症、糖尿病等。糖代谢、脂代谢等方面的问题，也会激发脑供血不足导致大脑萎缩，结局就是发生痴呆。',
                '病毒感染。一些慢病毒的感染，这种病原体也会导致老年痴呆。',
                '吸烟。老年男性一定要注意，最好戒烟。吸烟过量会让大脑出现不同程度的萎缩，导致痴呆。'
              ]
            },
            {
              tit: '三、预防老年痴呆',
              content: [
                '要防止动脉硬化。解决膳食问题，要低盐、低脂饮食，结合自己情况适当开展体育运动。',
                '日常生活中少用铝制品，少吃含铝食物，如油条油饼，他们的成分中含有明矾就是三氧化二铝。',
                '要戒烟戒酒，烟中含有尼古丁，酒精中含甲醛，一定要把烟酒控制好才能保护好大脑。',
                '补充有益的矿物质和微量元素，找到适合自己的合理搭配饮食。',
                '注意多活动，尤其是频繁活动手指。',
                '培养各种各样的兴趣，有时候记忆力不好的病人未必能达到痴呆的程度，这时可以参与讲座活动，学习自己感兴趣的东西。',
                '一定要多接触其他人，参加社会活动。只有接触周围的环境，老年人才能让自己的大脑每天都处在一个活跃状态。',
                '学习外语，老年人最大的优势就是有的是时间，没有学过可以从字母开始慢慢学，学习外语会让大脑更活跃一些。',
                '保持家庭和睦。',
                '要保持对事业的追求，退休以后，将日常生活中的任何一件事情，当成事业来做，调整每天的生活。'
              ]
            },
            {
              tit: '四、老年痴呆的饮食调理',
              content: [
                '老年人要常吃豆腐乳，豆腐乳是原汁原味的，而不是街边那种油炸的。豆腐乳是用豆腐干做的，豆腐干是大豆做的，对大脑有好处。',
                '经常咀嚼口香糖，但是一定要根据自身的情况决定。糖尿病病人不太适合。经常做咀嚼动作对记忆力有好处。',
                '多吃鱼，老年人一定要少吃猪肉，脂肪含量太高，而鱼肉则不同，尤其是深海鱼，它含很多卵鳞脂，对大脑有好处。',
                '常吃大豆，多食用一些不饱和的脂肪酸。',
                '要补充叶酸，颜色深的绿叶蔬菜里面就含有大量叶酸。'
              ]
            },
            {
              tit: '五、简易的有效运动',
              contentDis: [
                '预防老年痴呆症，老年人可以去做一下体检，然后确定适合自己身体状态的运动。'
              ],
              content: [
                '太极拳。练太极拳能在大脑皮层形成一个特殊兴奋区，而其他区域处于抑制状态，对大脑有好处；而且练太极拳会提高人体平衡能力和协调能力，动作非常舒缓，适合老年人。练太极拳对植物神经能产生良好的影响。',
                '散步。70 岁以上的老人一定要养成散步的习惯。散步会让人放松，有助于保持大脑清醒，防止老年痴呆。它可以增加血液循环，暗示大脑皮层进入休息状态。运动的时候全身血液循环加快，大脑的血液供应状况也会得到改善，对维持大脑白天的活动有好处。散步一定要摆好姿势，抬头挺胸，眼睛平视前方，臀部肌肉保持紧张，双臂自然摆动，步幅一定要适中，呼吸有节奏。',
                '健身球也适合老年人锻炼使用。手掌之中转动，会刺激手上的穴位和经络，能够改善人体的生理状况。长期做健身球训练，不仅能够调节中枢神经，增加记忆力，还可以开发智力，调和气血，疏经健骨。',
                '带棋盘的棋老人也可以玩，下棋可以运动大脑思维，防止脑的老化，促进计算力、记忆力等各个方面的能力保持，也是老年人融入社会、减少孤立的一种方法。但是时间不要太长，不超过一小时，输赢也不必放在心上。'
              ]
            }
          ]
        },
        {
          tit: '了解老年糖尿病',
          titDis: '',
          contentMain: [{
              tit: '一、老年人患糖尿病的原因',
              contentDis: [

              ],
              content: [
                '机体组织老化,基础代谢率下降,胰腺随年龄增高而逐渐老化,胰腺的β细胞功能降低,胰岛素分泌量减少,全身各器官衰老不协调。',
                '生活质量提高,营养成分改善,老年肥胖者尤其腹部肥胖逐渐增多,肥大的脂肪细胞膜上单位面积的胰岛素受体相对减少,其与胰岛素结合的亲和力降低,导致机体对胰岛素的敏感性大大降低,出现胰岛素抵杭。',
                '体力活动减少,机体利用和消耗葡萄糖量减少,导致机体对胰岛素的敏感性降低,糖耐量减弱。'
              ]
            },
            {
              tit: '二、老年人糖尿病带来哪些危害',
              content: [
                '早期发病很隐蔽:老年2型糖尿病发病很隐蔽、缓慢,容易发生误诊、漏诊的情况,从而引发并发症的几率大。',
                '初期症状不明显:老年2型糖尿病初期症状一般都不明显,往往没有三多一少的症状,即使有些人有轻微的症状,也常自以为是老年虚弱的表现而未予注意。他们可能在眼睛、心脏等出现并发症就诊时才发现元凶。',
                '易出现低血糖:可能与热量控制过的低有关,病重卧床、活动量不足、优降糖或胰岛素用量过大时出现。',
                '易引发血管病变:糖尿病一般病程较长,易发生各种大血管或微血管并发症,如高血压、高脂血症、冠心病、痛风、肾脏病变、视网膜病变、末梢神经病变,皮肤搔痒、脑卒中和各种感染症状。'
              ]
            },
            {
              tit: '三、老年人患上糖尿病的症状',
              content: [
                '得了糖尿病会出现怎样的症状?如果皮肤发痒、干燥、剥落、发红及疼痛,那么就有可能是染了湿疹,此时就应该时常保持皮肤湿润。但同时也可能因肝脏无法正常发挥功能引起,这就可能与糖尿病有关了。如果胆汁阻塞,积聚在血管内,就可能使得皮肤出现痕痒,这是糖尿病的症状。',
                '糖尿病症状表现为消瘦,糖尿病患者在患病以后,体内葡萄糖利用减少,脂肪分解增加,导致蛋白质合成不足,分解加快等,会引起消瘦,如有多尿症状,体内水分的丢失更会加重消瘦症状。同样,病程时间越长,血糖越高,糖尿病患者病情越重,消瘦也就越明显。',
                '如果人平时睡眠不足,身体容易疲乏,眼睛就会满是红筋,但同时也有可能是患了虹膜炎的表现。虹膜炎的产生可能与自身的肠胃炎性或者关节炎等病毒感染或自主免疫性疾病所引起。',
              ]
            },
            {
              tit: '四、老年人如何预防糖尿病',
              content: [
                '注意及时的发现,早期发现糖尿病,更是有助于健康。年龄超过40岁并有体重超重或肥胖,尤其腹型肥胖者,有糖尿病家族史,有高血压、高脂血症、脂肪肝等糖尿病高危因素者,一旦餐前出现心悸、出汗、面色苍白、颤抖等表现,进食就缓解,应警惕糖尿病,及时到医院检查,尽早明确诊断。',
                '注意较为合理的饮食习惯,注意正常的饮食方式。糖尿病患者生活必须有“规矩”和规律,饮食必须合理,不仅在于吃什么,还在于吃的时间要规律,饮食定时定量,保持每日基本稳定的摄食量,不能随意变动,患者吃东西时间和进食量有变化时,应及时调整药物剂量。',
                '注意规律的运动,注意合适的运动量。运动疗法是糖尿病病人综合治疗的五架马车之一。不过,物极必反,剧烈运动可致低血糖发生,糖友运动要有计划,做到适量、规律运动,剧烈运动或体力活动增加时应及时加餐或酌情减少降糖药物的用量。'
              ]
            }
          ]
        },
        {
          tit: '了解老年高血压',
          titDis: '高血压是三高的一种,一般的攻击对象多是老人。由于老年人的体质下降,抵抗力不如以前,因此才让这些病菌乘虚而入。那么老人高血压是什么原因?接下来我们就来看看解决的方法吧!',
          contentMain: [{
              tit: '一、老人高血压是什么原因',
              contentDis: [
                '生理因素和社会因素,包括环境、膳食、精神、吸烟、肥胖、饮酒等都可能造成老年人血压升高。'
              ],
              content: [
                '一般认为在引起高血压的比例上,遗传因素占40%。在现实生活中,高血压具有明显的家族遗传性,如果父母均有高血压,其子女发病概率高达46%。大约有60%的高血压患者具有高血压家族遗传史。',
                '年龄因素也是引起高血压的原因之一。随着年龄增加,血管弹性变差,血管老化,血管阻力增加,因而血压随之升高。因此,老年人更易发生高血压。老年高血压一部分是由老年前期高血压延续而来,大部分是由于大动脉内膜和中层变性,胶原、弹性蛋白、脂质和钙质含量增加,导致动脉弹性减退,顺应性下降而致。',
                '饮食中钠盐摄入过多、低钙、高蛋白、高脂饮食均能引起血压升高,导致高血压的发生。饱和脂肪摄入越高,平均血压水平和患病率也越高。食盐<2g>20g/日发病率30%。虽然说吃得咸并不代表一定会患高血压,但有大量的高血压临床调查可以发现,大部分高血压患者的食盐量都是较大的。吸收过多的钠盐很容易会使血压升高,而高钙和高钾饮食可降低高血压的发病率。',
                '环境因素是引起高血压的原因中较常见的原因。在引起高血压的比例上,环境因素约占60%。噪音的工作环境,过度紧张的脑力劳动均易发生高血压,城市中的高压发病率高于农村。',
                '体重指数增加是高血压的原因里的危险因素。肥胖人脂肪多,这不仅引起动脉硬化,而且还因脂肪组织内微血管的增多,造成血流决量增加,结果易产生血压。目前认为体重指数大于24为肥胖。流行病学调查表明血压常随体重指数的增大而升高,向心性肥胖者常伴有血压升高。肥胖病人常伴有胰岛素功能障碍,二者常使血胰岛素增高,从而促进高血压的发生和发展。',
                '不良的生活习惯也是导致高血压的原因之一,其中吸烟饮酒是主要的高血压发病原因。事实证明,吸烟可加速动脉粥样硬化,心跳加快,收缩压和舒张压升高。吸烟者易患恶性高血压,且易死于蛛网膜下腔出血,而且尼古丁影响降压药的疗效。'
              ]
            },
            {
              tit: '二、老人高血压怎么办',
              content: [
                '血压高在平时的生活当中要非常注意饮食,很多食物不能吃的一定不能吃。减少钠盐的摄入,每天摄入盐量不得多于6克为宜;高脂肪类食物应该减少;猪肉、油炸等食物尽量少吃或不吃;适量补充蛋白质类食物,此外蔬果水果类食物可以多吃;减少饮酒;喝酒是导致血压高的重要因素,有血压高的患者应该减少饮酒。',
                '茶中含有丰富的茶多酚,对于人体内脂肪的代谢有着促进的作用。高血压人群的胆固醇、三酸甘油脂都偏高,并且血管内壁脂肪沉积。平时多喝茶对于降低胆固醇、三酸甘油脂有非常好的效果,并且可以促进血管内壁脂肪的分解。',
                '血压高的患者通常体重也会上升,两者之间存在着密切的关联。高血压患者降低体重可以有效地降低患高脂血症、使左心室肥厚、降低胰岛素等。可以通过控制热量的摄入以及进行体育锻炼来达到控制体重的目的。',
                '老年人高血压可以进行适量的运动以降低收缩压和舒张压,并且对于增强体质、抵抗力、减体重都有非常好的效果。对于老人来说,慢跑、太极拳等运动方式都是一个不错的选择。'
              ]
            },
            {
              tit: '三、老人高血压注意事项',
              content: [
                '有高血压病的老年人看电视时间不宜过长,因为电视辐射可致血压升高,尤其是情节紧张的电视节目,可使人情绪激动,易诱发脑血管意外。',
                '高血压病人要经常保持稳定的情绪,避免过度兴奋、紧张,不宜参加竞争性很强的娱乐活动,否则,会因为情绪波动,交感神经兴奋,而引起全身血管收缩,心跳加快,血压升高,甚至可能引起脑溢血。',
                '高血压病人服用降压药一段时间,如果突然停药,有可能出现“降压停药综合征”,患者表现为血压大幅度反跳升高,出现头晕、恶心、失眠、出汗等症状,甚至发生脑血管意外等病变。',
                '节日喜庆,亲友来访,待客频繁,高血压病人在这种情况下,要特别注意尽量不要打乱原有的生活规律。美国学者研究发现,患高血压病的人,说话30分钟,90%血压会升高。因此,老年高血压病患者,不宜频繁和长时间接待客人。'
              ]
            }
          ]
        }
      ]
    };
  },

  components: {},

  computed: {},

  methods: {}
}
</script>

<style lang="scss" scoped>
.healthy {
  .tabList {
    display: flex;
    justify-content: center;
    margin: 0 auto 120px;

    span {
      display: block;
      width: 380px;
      height: 120px;
      line-height: 120px;
      background: #fff;
      text-align: center;
      border: 1px solid #038489;
      margin: -60px 15px 0;
      color: #038489;
      font-size: 24px;
      position: relative;
      z-index: 999;
      transition: all .3s ease-in;
    }

    span:hover {
      cursor: pointer;
    }
  }

  .healthyContent {
    width: 1200px;
    margin: 0 auto 120px;

    h2 {
      text-align: center;
      padding: 0 0 28px 0;
      border-bottom: 1px solid #999;
    }

    .titDis {
      margin: 28px 0;
    }

    h3 {
      margin: 24px 0 12px 0;
    }

    p {
      line-height: 2;
      text-indent: 2em;
    }
  }
}
</style>
